# Pandas Assignment 3 (A)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset

In [2]:
df = pd.read_csv('Pandas Assignment 2A.csv')

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names = pd.read_csv('Pandas Assignment 2A.csv')

### Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
baby_names = baby_names.drop([ 'Unnamed: 0' ,'Id'], axis = 1)

In [6]:
baby_names

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [7]:
baby_names.Gender.value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [8]:
names = baby_names.groupby('Name').sum()

In [9]:
names

,Year,Gender,State,Count
Name,,,,
Aaban,4027,MM,NYNY,12
Aadan,8039,MMMM,CACACATX,23
Aadarsh,2009,M,IL,5
Aaden,393963,MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM...,ALALALALALALALARARARAZAZAZAZAZAZCACACACACACACA...,3426
Aadhav,2014,M,CA,6
...,...,...,...,...
Zyra,14085,FFFFFFF,CACACAFLTXTXTX,42
Zyrah,4024,FF,CATX,11
Zyren,2013,M,TX,6
Zyria,20089,FFFFFFFFFF,GAGAGALALALATXTXTXTX,59
Zyriah,18087,FFFFFFFFF,GAGALATXTXTXTXTXTX,58

### Step 8. How many different names exist in the dataset?

In [10]:
names.drop(['Year' , 'Count'] , axis=1)

,Gender,State
Name,,
Aaban,MM,NYNY
Aadan,MMMM,CACACATX
Aadarsh,M,IL
Aaden,MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM...,ALALALALALALALARARARAZAZAZAZAZAZCACACACACACACA...
Aadhav,M,CA
...,...,...
Zyra,FFFFFFF,CACACAFLTXTXTX
Zyrah,FF,CATX
Zyren,M,TX
Zyria,FFFFFFFFFF,GAGAGALALALATXTXTXTX
Zyriah,FFFFFFFFF,GAGALATXTXTXTXTXTX

In [11]:
baby_names.Name.nunique()

17632

### Step 9. What is the name with most occurrences?

In [12]:
baby_names.groupby('Name').Count.sum().sort_values(ascending = False)

Name
Jacob         242874
Emma          214852
Michael       214405
Ethan         209277
Isabella      204798
               ...
Eniola             5
Atlantis           5
Marci              5
Simarpreet         5
Nita               5
Name: Count, Length: 17632, dtype: int64

In [13]:
names.Count.idxmax()

'Jacob'

### Step 10. How many different names have the least occurrences?

In [14]:
names[names.Count == names.Count.min()]

          Year Gender State  Count
Name
Aadarsh   2009      M    IL      5
Aadin     2008      M    TX      5
Aaima     2013      F    NY      5
Aalaya    2014      F    CA      5
Aaminah   2004      F    CA      5
...        ...    ...   ...    ...
Zyien     2009      M    TX      5
Zyire     2007      M    NY      5
Zykeriah  2008      F    AL      5
Zykierra  2007      F    GA      5
Zymari    2009      M    NC      5

[2578 rows x 4 columns]

In [15]:
(names.Count == names.Count.min()).sum()

2578

### Step 11. What is the median name occurrence?

In [16]:
names[names.Count == names.Count.median()]

          Year    Gender             State  Count
Name
Aishani  14078   FFFFFFF    CACACACACAILNJ     49
Alara    16079  FFFFFFFF  CACACAFLNYNYNYTX     49
Alysse   16057  FFFFFFFF  CACACAMINYTXTXTX     49
Ameir    16086  MMMMMMMM  CAMIMIMIMIMINYOH     49
Anely    16071  FFFFFFFF  CACACACACACACACA     49
...        ...       ...               ...    ...
Sriram   14054   MMMMMMM    CACACACACACATX     49
Trinton  16069  MMMMMMMM  FLLAOKTXTXTXTXTX     49
Vita     14075   FFFFFFF    CACACACACANYNY     49
Yoni     16060  MMMMMMMM  CACACACACACAFLFL     49
Zuleima  14050   FFFFFFF    AZCACACACACACA     49

[66 rows x 4 columns]

In [17]:
(names.Count == names.Count.median()).sum()

66

### Step 12. What is the standard deviation of names?

In [18]:
names.Count.std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [19]:
baby_names.describe()

               Year         Count
count  1.016395e+06  1.016395e+06
mean   2.009053e+03  3.485012e+01
std    3.138293e+00  9.739735e+01
min    2.004000e+03  5.000000e+00
25%    2.006000e+03  7.000000e+00
50%    2.009000e+03  1.100000e+01
75%    2.012000e+03  2.600000e+01
max    2.014000e+03  4.167000e+03